Revit 2027 API
SpatialFieldManager.AddSpatialFieldPrimitive Method
 Creates empty analysis results primitive not associated with any geometry element
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int AddSpatialFieldPrimitive()
Public Function AddSpatialFieldPrimitive As Integer
public:
int AddSpatialFieldPrimitive()
member AddSpatialFieldPrimitive : unit -> int
Return Value
Int32
 Unique index of primitive for future references
See Also
Reference
SpatialFieldManager Class
AddSpatialFieldPrimitive Overload
Autodesk.Revit.DB.Analysis Namespace